using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
namespace SagaScript.M50085000
{
    public class S11002174 : Event
    {
        public S11002174()
        {
            this.EventID = 11002174;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 131, "因為...是這樣的$R;" +
            "$P…$R;" +
            "$P……$R;", "你好...");
            Select(pc, "說吧……？", "", "問候一下");
            ShowEffect(pc, 11002174, 4520);
            Wait(pc, 495);
            NPCMove(pc, 11002174, 350, 650, 45, MoveType.NONE);

            Say(pc, 131, "什麼！？$R;" +
            "$P這裡是什麼地方...$R;" +
            "$R這裡是實驗室。$R;" +
            "對呀！曾經在這裡研究關於「キカイ文明」的實驗室。$R;" +
            "$P對了，這裡...$R;" +
            "最近這裡不知幹什麼...究竟他們目的是什麼？$R;" +
            "$P或許，你不知道我在說什麼$R;" +
            "但對你說的時候$R;" +
            "這裡エミル世界的$R;" +
            "存在於衛城街道的實驗室。$R;", "？？？");

            Say(pc, 131, "「アクロポリス」っていうのは」$R;" +
            "說起來...這個是世界第一大城市 — って都市。$R;" +
            "$P當正調查遺跡的時候$R;" +
            "發現你正在昏迷...。$R;" +
            "$P就展開調查了你的身體$R;" +
            "其間發現了你是DEM...並且在調查當中發現了奇怪的結構。$R;" +
            "首先你的代謝對我們是一個驚奇的發現。$R;" +
            "$P身體就是機械$R;" +
            "$R能攝取食物及飲料,可以變成能源。$R;" +
            "可惜，你還需要呼吸空氣...。$R;" +
            "簡單地說$R;" +
            "$P食物和空氣與人同樣地是必然的。$R;" +
            "不過因為身體是機械，所以不可以憑依...$R;" +
            "$R對不起...$R;" +
            "還未自我介紹$R;" +
            "我是誇克博士。$R;" +
            "$P您好...$R;", "？？？");

            Say(pc, 131, "このエレキテル・ラボラトリーの$R;" +
            "實驗室的負責人會$R;" +
            "$P幫助你$R;" +
            "因為他的興趣只是發明機械。$R;" +
            "$P對DEM來說是令人害怕的$R;" +
            "那種感覺...$R;" +
            "好像不是個理由$R;" +
            "不過你就暫時在這個世界生活吧$R;" +
            "$R當到了適當的時候$R;" +
            "$P人間界、天上界這二個世界$R;" +
            "就會再喜歡你...$R;" +
            "$R歡迎你。$R;", "クォーク");

            Say(pc, 131, "我總在這裡的$R;" +
            "如果你要維修機械$R;" +
            "$P你隨時候也可以來的$R;" +
            "或者你…$R;" +
            "總之是關於DEM種族的事就來吧$R;" +
            "$P如果想到傷腦筋…$R;" +
            "請使用這個的。 $R;", "クォーク");

            GiveItem(pc, 10063701, 1);
            Say(pc, 0, 65535, "ＤＥＭａｎｕａｌを渡された。$R;", " ");

            Say(pc, 131, "使用這個的話...$R;" +
            "還有很多關於這個的說明$R;" +
            "$P是這樣。$R;" +
            "這個需要一些東西$R;" +
            "$R我正在想...$R;" +
            "$P對了...那就是…$R;" +
            "謎一樣的エリス$R;" +
            "是怎麼樣的東西呢......$R;" +
            "$P好了$R;" +
            "$P我家裡是在東南方的 ...$R;" +
            "要不要去看看，怎麼樣？$R;" +
            "$R試試看吧$R;", "夸克");

            pc.EP = 30;
            int oldMap = pc.CInt["Beginner_Map"];            
            Warp(pc, 10024000, 157, 157);
            DeleteMapInstance(oldMap);
        }
    }
}